In [32]:
import numpy as np
import pandas as pd

In [33]:
np.random.seed(100)

In [34]:
arr = np.random.randn(4,4).round(2)
arr

array([[-1.75,  0.34,  1.15, -0.25],
       [ 0.98,  0.51,  0.22, -1.07],
       [-0.19,  0.26, -0.46,  0.44],
       [-0.58,  0.82,  0.67, -0.1 ]])

In [35]:
arr[:,2]

array([ 1.15,  0.22, -0.46,  0.67])

In [36]:
df = pd.DataFrame(arr, columns="W X Y Z".split(), \
                 index = ['India','US','Japan','Germany'])
df

            W     X     Y     Z
India   -1.75  0.34  1.15 -0.25
US       0.98  0.51  0.22 -1.07
Japan   -0.19  0.26 -0.46  0.44
Germany -0.58  0.82  0.67 -0.10

In [37]:
df = pd.DataFrame(arr)
df

      0     1     2     3
0 -1.75  0.34  1.15 -0.25
1  0.98  0.51  0.22 -1.07
2 -0.19  0.26 -0.46  0.44
3 -0.58  0.82  0.67 -0.10

In [38]:
df.columns = ['Red','Yellow','Blue','Pink']
df.index = ['A','B','C','D']
df

    Red  Yellow  Blue  Pink
A -1.75    0.34  1.15 -0.25
B  0.98    0.51  0.22 -1.07
C -0.19    0.26 -0.46  0.44
D -0.58    0.82  0.67 -0.10

In [39]:
data_file = 'E:\\HSBC\\DA Training\\Day 4\\titanic_train.csv'
train = pd.read_csv(data_file)
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [40]:
train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [41]:
#train.info()
train.shape

(891, 12)

In [42]:
# All rows for column labels
type(train['Age'])
train['Age']

train[['Age','Pclass','Sex']].head()

    Age  Pclass     Sex
0  22.0       3    male
1  38.0       1  female
2  26.0       3  female
3  35.0       1  female
4  35.0       3    male

In [43]:
#Feature Engineering
train['Age in days'] = train['Age']*365
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age in days
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,8030.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,13870.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,9490.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,12775.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,12775.0

In [44]:
train.drop('Age in days', axis=1, inplace=True) 
# axis=1 is for looking this key in columns; axis=0 by default looks for this in rows
# inplace=False was creating a copy of DF; drop wasn't reflected in original DF
train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [45]:
# All columns for row labels
train.loc[4]
train.loc[:4]

# All entries for row  & column labels
train.iloc[3,3]
train.iloc[:3,:3]
train.iloc[4,:5]

PassengerId                           5
Survived                              0
Pclass                                3
Name           Allen, Mr. William Henry
Sex                                male
Name: 4, dtype: object

In [46]:
#Quick Statistical summary of the data (ONLY NUMERIC)
train.describe().round(2)
train.describe().round(2).T

             count    mean     std   min     25%     50%    75%     max
PassengerId  891.0  446.00  257.35  1.00  223.50  446.00  668.5  891.00
Survived     891.0    0.38    0.49  0.00    0.00    0.00    1.0    1.00
Pclass       891.0    2.31    0.84  1.00    2.00    3.00    3.0    3.00
Age          714.0   29.70   14.53  0.42   20.12   28.00   38.0   80.00
SibSp        891.0    0.52    1.10  0.00    0.00    0.00    1.0    8.00
Parch        891.0    0.38    0.81  0.00    0.00    0.00    0.0    6.00
Fare         891.0   32.20   49.69  0.00    7.91   14.45   31.0  512.33

In [47]:
# Find details for all peole woth Age>40 ?
train['Age']>40
train[train['Age']>40].count()[0]
train[train['Age']>40].shape[0]
len(train[train['Age']>40])

150

In [48]:
train[train['Age']>40][['Name','Sex']]

                                                  Name     Sex
6                              McCarthy, Mr. Timothy J    male
11                            Bonnell, Miss. Elizabeth  female
15                    Hewlett, Mrs. (Mary D Kingcome)   female
33                               Wheadon, Mr. Edward H    male
35                      Holverson, Mr. Alexander Oskar    male
..                                                 ...     ...
862  Swift, Mrs. Frederick Joel (Margaret Welles Ba...  female
865                           Bystrom, Mrs. (Karolina)  female
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female
873                        Vander Cruyssen, Mr. Victor    male
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female

[150 rows x 2 columns]

In [49]:
# Prob. of Age > 40
train[train['Age']>40].shape[0] / train.shape[0]

0.16835016835016836

In [50]:
# Prob. of Age > 40 and Pclass == 1
train[(train['Age']>40) & (train['Pclass']==1)]
train[(train['Age']>40) & (train['Pclass']==1)].count()[0]

76

In [51]:
# Mean of ages of all ppl travelling with Pclass == 1 ,2 ,3 ?
train[train['Pclass']==1]['Age'].mean(), train[train['Pclass']==2]['Age'].mean(), train[train['Pclass']==3]['Age'].mean()

(38.233440860215055, 29.87763005780347, 25.14061971830986)

In [52]:
# GROUPBY Funcyion
train.groupby(by='Pclass')[['Age','Fare']].mean().round(2)

          Age   Fare
Pclass
1       38.23  84.15
2       29.88  20.66
3       25.14  13.68

In [53]:
train['Sex'].unique() # fetch the unique values
train['Embarked'].unique()
train['Embarked'].nunique() # fetch no. of unique values

3

In [54]:
train['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [55]:
train[ (train['Age']>50) & (train['Survived']==1)].shape[0]

22

In [56]:
# Name and Pclass of 5 oldest ppl?
train.sort_values(by='Age',ascending=False)[['Name','Pclass']].head()
train.nlargest(5,'Age')[['Name', 'Pclass']]

                                     Name  Pclass
630  Barkworth, Mr. Algernon Henry Wilson       1
851                   Svensson, Mr. Johan       3
96              Goldschmidt, Mr. George B       1
493               Artagaveytia, Mr. Ramon       1
116                  Connors, Mr. Patrick       3

# Examples

In [57]:
# Q1 => Prob of Males
train[train['Sex'] == 'male'].shape[0] / train.shape[0]

0.6475869809203143

In [58]:
# Q2 => Prob of Survival by anyone
train[train['Survived']==1].shape[0] / train.shape[0]

0.3838383838383838

In [59]:
# Q3/Q5 => Prob of Male was travelling ALone (JOINT PROBABILITY)
# Add a Alone column to check for this?(apply method)
# Approach 1
JP_1 = train[(train['Sex'] == 'male') & (train['SibSp']==0) & (train['Parch']==0)].shape[0] / train.shape[0]

# Approach 2
def alone(train):
    if (train['SibSp'] + train['Parch']) > 0: 
        return 0
    return 1
train['Alone'] = train.apply(alone,axis=1)
JP = train[(train['Alone'] == 1) & (train['Sex'] == 'male')].shape[0] / train.shape[0] # Joint Prob so we / by total shape
JP_1, JP

(0.4612794612794613, 0.4612794612794613)

In [60]:
# Q4 => Prob of 1st CLass passengers boarded from Cheurbough
train[(train['Pclass']==1) & (train['Embarked']=='C')].shape[0]

85

In [61]:
# Q5 => Prob that a Male is travelling Alone 
# CONDITIONAL PROBABILITY => (P(ALone | Male) = P(ALone ^ Male) / P(Male))
P_male = train[train['Sex'] == 'male'].shape[0] / train.shape[0]

JP / P_male

0.7123050259965338